<template>
  <div class="profile">
    <div class="section-banner">
      <div class="wrap-banner">
        <div class="container">
          <div class="banner-content">
            <h1>
              Абдыкеримова Алтынай Рысбековна
            </h1>
            <p>
              Кандидат на выборы депутатов <br> Жогорку Кенеша
            </p>
            <button @click="toGoals">
              Моя цель внести 5 изменений <br> в энергосферу нашей страны!
            </button>
          </div>
        </div>
        <router-link :to="{ hash: '#scrolSpy' }" class="wrap-banner__btn">
          <div class="wrapper-btn-imgs">
            <img class="fade1" :src="arrDown" alt="">
            <img class="fade2" :src="arrDown" alt="">
            <img class="fade3" :src="arrDown" alt="">
          </div>
        </router-link>
      </div>
    </div>
    <div class="section-info" id="scrolSpy">
      <div class="container-info">
        <div class="info-all-wrappers">
          <div class="info-wrappers">
            <div class="info-wrapper__project wrapper__project_goals" @click="toGoals">
              <div class="project_goals">
                <div class="project_goals_content">
                  <h1 >
                    Топ-5
                  </h1>
                  <p>
                    Мои цели
                  </p>
                </div>
              </div>
            </div>
            <div class="info-wrapper__project">
              <div class="info-wrapper__project_me" @click="showAboutMe">
                <div class="project_me">
                  <div class="project_me_content">
                    <h1>
                    Кто я
                  </h1>
                  <p>
                    Мои достижение
                  </p>
                  </div>
                </div>
              </div>
              <div class="info-wrapper__project_cages" @click="showCages">
                <div class="project_me_content">
                  <h1>
                    КАГЭС-1
                  </h1>
                  <p>
                    Национальный проект
                  </p>
                </div>
              </div>
            </div>
          </div>
          <div class="info-wrappers info-wrappers_second">
            <div class="info-wrapper__project">
              <div class="info-wrapper__project_socials" @click="showGoal">
                <div class="project_me_content">
                  <h1>
                    Менеджмент
                  </h1>
                  <p>
                    реформа в системе управления
                  </p>
                </div>
              </div>
              <div class="info-wrapper__project_contacts" @click="showSocial">
                <div class="project_me_content" >
                  <h1>
                    Контакты
                  </h1>
                  <p>
                    Соц сети
                  </p>
                </div>
              </div>
            </div>
            <div class="info-wrapper__project" @click="showRezume">
              <div class="project_cv">
                <div class="project_me_content">
                  <h1>
                    Резюме
                  </h1>
                  <p>
                    Более 5 лет опыта
                  </p>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <Footer />
    <div class="modal-menegment" :class="{ active : isActiveGoal }">
      <div class="modal-menegment-wrapper">
        <div class="modal-menegment-body">
          <div class="modal-menegment__content">
            <img :src="clsBtn" alt="" @click="clsModal">
            <div class="wrapper-info__ges">
              <div class="info__ges-title info__ges-title_reform">
                <h1>
                  Менеджмент - реформа в системе управления
                </h1>
              </div>
              <div class="info__ges-descr">
                <div class="scrol-descr">
                  <p>
                    <b>Так много дублирующих друг друга организаций… </b> <br><br> Так много дублирующих обязанности друг друга организаций и так мало ответственных. С осознания этого факта и надо начинать! <br> <br> В Энергосистеме очень много органов, холдингов и, само Министерство Энергетики. К сожалению, опять отмечу – они дублируют обязанности друг друга. <br> <br> Такого рода менеджмента не должны существовать. Они просто недопустимы. Такой образ управления подвергает риску весь энергосектор.<br><br> <b>Неэффективность – как нормальное!</b> <br><br>Неэффективность существующего количества органов уже доказало мою теории об ошибочном управлении стратегически важными ресурсами страны. По факту, на сегодняшний день может издавать указ исходящий из каждого, вышеперечисленного органа и они могут противоречить или дублировать друг друга. Строятся планы относительно энергосистемы, но они никогда не доходят до конца или до логического завершения. Причин всегда уйма, но нет органа, который бы смог контролировать действия и отчёты всех проектов по стране. <br><br><b>Что такое прозрачность?</b> <br><br>Необходимо стремиться к прозрачности системы. Для этого надо объединить, упразднить и сократить количество организаций. Систематизировать каждую из организаций, где есть: <br><br> &nbsp; &nbsp; &nbsp; 1.	Четкий план работ на определённый период. <br><br> &nbsp; &nbsp; &nbsp; 2.	Прописать должностные обязанности.<br><br> &nbsp; &nbsp; &nbsp; 3.	Прописать вертикаль менеджмента (кто кому подчиняется).<br><br> &nbsp; &nbsp; &nbsp; 4. Всегда есть ответственный руководитель, который знает, что и как надо делать. При чем, информация о данном руководителе и проектах, которыми он руководит была доступна каждому жителю. Это необходимо, чтобы не было поиска ответственного за провал того или иного проекта.<br><br> &nbsp; &nbsp; &nbsp; 5.	Официальная служба связи с общественностью, где даётся чёткая информация по каждому из проектов и стадиях   развития проектов.<br><br> &nbsp; &nbsp; &nbsp; 6.	Горячая линия во всех цифровых форматах, где каждый житель страны может получить актуальную информацию.<br><br> &nbsp; &nbsp; &nbsp; 7.	«Открытая доска жалоб и предложений», где каждый житель может оставить своё предложение или жалобу относительно представителя сотрудника энергосферы, сбоев поставки электричества дальних районов страны или любых других моментов. Как мы можем говорить, если не знаем и 90% сложностей нашего народа. <br><br>Только так мы сможем получить адекватную и реальную обратную связь и повысить эффективность всех прилагаемых действий. <br><br> <b> К чему надо стремиться? </b> <br><br> Надо стремиться к оптимизации договорённых обязательств уже существующих частных распределительных компаний перед генерирующей компанией и в её пользу.<br><br> Надо стремиться к контролю обязательств распределительных компаний на соблюдение ими обязательств и изымать лицензии на продажу электричества населению. Эти действия помогут резко сократить количество частных компаний, чья деятельность является довольно сомнительной и не приносящей ни пользу населению, ни прибыли государству.
                  </p>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div class="modal-social" :class="{ active : isActiveSoc }">
      <div class="modal-social-wrapper">
        <div class="modal-social__body">
          <div class="modal-social__content">
            <img class="modal-social__content_btn" :src="closesBtn" alt="" @click="clsModal">
            <div class="modal-social__wrap">
              <div class="modal-social__wrap-info">
                <p>
                  Все ваши пожелания или комментарии по улучшению ситуации в стране можно предложить по контактам:
                </p>
                <a href="tel:+996505556633">
                  <img :src="phone" alt="">
                  +996 505 556 633
                </a>
                <a href="mailto:altinay.abdykerimova@gmail.com">
                  <img :src="envelop" alt="">
                  altinay.abdykerimova@gmail.com
                </a>
                <a href="https://yandex.ru/maps/-/CCUuQUdk9A" target="_blanc">
                  <img :src="location" alt="">
                  Кыргызстан, г. Бишкек, ул. Гражданская 2-45
                </a>
              </div>
              <a href="https://yandex.ru/maps/-/CCUuQUdk9A" target="_blanc" class="modal-social__wrap-map">
                <img :src="onMap" alt="">
                  Штаб квартира
              </a>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div class="modal-kages" :class="{ active : isActiveCag }">
      <div class="modal-kages-wrapper">
        <div class="modal-kages-body">
          <div class="modal-kages__content">
            <img :src="clsBtn" alt="" @click="clsModal">
            <div class="wrapper-info__ges">
              <div class="info__ges-title">
                <h1>
                  Строительство КАГЭС-1 <br> и статус «Национальный Проект»
                </h1>
              </div>
              <div class="info__ges-descr">
                <div class="scrol-descr">
                  <p>
                    &nbsp;&nbsp;&nbsp;&nbsp;Без ввода новых мощностей, энергосистема Кыргызской Республики через несколько лет может превратиться из избыточной в дефицитную энергосистему и, для удовлетворения спроса потребителей, Республика будет вынуждена импортировать электроэнергию из соседних государств по ценам, значительно превышающим национальные тарифы. <br><br> &nbsp;&nbsp;&nbsp;&nbsp;В такой ситуации весьма перспективным направлением развития энергетики Республики является привлечение иностранных инвестиций для строительства новых гидроэлектростанций и реконструкции существующих источников электроэнергии. Приоритетным инвестиционным проектом является строительство каскада Камбаратинской ГЭС-1 и ГЭС-2 с суммарной установленной мощностью 2260 МВт и среднегодовой гарантированной выработкой электроэнергии более 6,0 млрд. кВт. час. <br><br> &nbsp;&nbsp;&nbsp;&nbsp; Однако для строительства КАГЭС -1 было привлечено несколько иностранных инвестиций, но результаты были не положительными и, вследствие чего, мы до сегодняшнего дня не начали возведение этого весьма значительного для энергетики Кыргызстана КАГЭС-1. Для реализации необходимо приостановить все строительство ГЭСов любых мощностей, а так же гос. строительство зданий и сооружений, требующих затраты в виде денежных средств государства или кредитных средств, и направить все силы на строительство КАГЭС-1.<br><br> &nbsp;&nbsp;&nbsp;&nbsp; Верхний Нарынский каскад должен быть в приоритете только после достижения строительства КАГЭС-1 минимум как на 50%. Таким образом, наше государство может начать строительство КАГЭС-1 в виде «АШАР», создать «Фонд строительства КАГЭС-1» и дать ему статус «Национального проекта». После того, как один агрегат будет запущен, все международные организации будут уверены в том, что строительство КАГЭС-1 будет завершено и это приведет к грантовым и кредитным содействиям с их стороны. <br><br>&nbsp;&nbsp;&nbsp;&nbsp; В результате - мы полностью обеспечим страну электроэнергией. Более того, будут созданы условия для экспорта электроэнергии и зимой, и летом, и весной. Мы будем полностью готовы к реализации договорных обязательств проекта CASA-1000 по экспорту электричества в Пакистан и Афганистан по цене минимум $ 5 за 1 кВч.
                  </p>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>

    <div class="modal-about-me" :class="{ active : isActiveAbout }">
      <div class="modal-about-me-wrapper">
        <div class="modal-about-me-body">
          <div class="modal-about-me__content">
            <img :src="clsBtn" alt="" @click="clsModal">
            <div class="wrapper-info__about-me">
              <div class="info__about-me-title">
                <h1>
                  Моя автобиография
                </h1>
              </div>
              <div class="info__ges-descr">
                <div class="scrol-descr">
                  <p>
                    &nbsp;&nbsp;&nbsp;&nbsp;Я, <b>Абдыкеримова Алтынай Рысбековна</b>, 17.08.1987 года рождения, уроженка г. Бишкек, Кыргызской Республики. В 1994 году поступила в Общеобразовательную школу №66 города Бишкек.

                    <br> <br> &nbsp;&nbsp;&nbsp;&nbsp;<b>В 2004 году</b> окончила школу с горящими на будущее глазами и поступила в Бишкеский Гуманитарный Университет им. К. Карасаева на факультет экономики и менеджмента. Закончив университет в 2012 году я начала свой долгий путь к становлению себя, как личность и, конечно же начала работать по специальности.
                    <br>
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;Следующие 7 лет пролетели для меня очень быстро и за это время я стала востребована как руководитель проектов и компаний. Так, в 2017 году я возглавила консалтинговую компанию «Ишеним». Находясь на данной должности, я впервые поняла, что я могу влиять на какую-то ситуацию и действительно помогать людям.
                    <br>
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;В апреле 2018 года, имея большой и уже весомый опыт в руководстве, я возглавила Филиал АО "Genser Genel Muhendislik Taahhut ve Ticaret A.S." в Кыргызстане. Данный проект по Реабилитации сектора энергетики Кыргызстана и проект реконструкции Токтогульских ГЭС «Фаза 1» стали для меня настоящим вдохновением и усилили понимание того, как именно я могу помогать Кыргызстану, делая действительно важные и стратегически верные проекты для страны.
                    <br>

                    <br>&nbsp;&nbsp;&nbsp;&nbsp;В июне 2018 года меня пригласили на должность руководителя проекта по Реконструкции Ирригационной системы Кыргызской Республики «Магистральный канал Сарымсак», протяжностью 10 км. в Таласской области. Здесь я столкнулась с первыми моими впечатлениями о некорректности топ-менеджмента и начала создавать систему, при которой есть ряд ответственных лиц и все занимаются тем, чем должны.

                    <br>&nbsp;&nbsp;&nbsp;&nbsp;В июне 2018 года, меня пригласили на должность руководителя проекта по Реконструкции Ирригационной системы Кыргызской Республики «Магистральный канал Сарымсак - протяжностью
                    10 км» Таласская область. Здесь я столкнулась с первыми моими впечатлениями о некорректности топ-менеджмента и начала создавать систему, при которой все занимаются тем, чем должны и есть ряд ответственных лиц.
                    <br>
                    <br> &nbsp; В 2019 году поступила в Дипломатическую Академию при МИД Кыргызской Республики на факультет "Международное отношение" по специальности "Международное право"
                    <br>
                    <br>&nbsp;&nbsp;&nbsp;&nbsp;В 2021 году я поступила в Кыргызский Государственный Технический Университет им. И. Раззакова, на факультет «Электроэнергетика, электротехника и электротехнология» по специальности «Инженер электрических станций» и теперь это является основным моим профессиональным направлением.
                  </p>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div class="modal-rezume" :class="{ active : isActiveRezume }">
      <div class="modal-rezume-wrapper">
        <div class="modal-rezume-body">
          <img class="closbtn" :src="closesBtn" @click="clsModal">
          <div class="modal-rezume__content">
            <div class="wrapper-info__rezume">
              <div class="info__rezume-title">
                <div class="info__rezume-title__name">
                  <h1>
                    Абдыкеримова Алтынай
                  </h1>
                  <p>
                    Более 5 лет опыта в должности <br>
                    <span>руководителя</span>
                  </p>
                </div>
                <img :src="rezuemProf" alt="">
              </div>
              <div class="info__rezume">
                <div class="info__rezume-content">
                  <ul class="info-rezume-content__list">
                    <li class="info-rezume-content__item">
                      <div class="info-rezume-content__year">
                        2020 <br> по н.в.
                      </div>
                      <div class="info-rezume-content__info">
                        <h3>Бухгалтер</h3>
                        <p>
                          УОО «Ассоциация мини-футбола КР»,
                          г.Бишкек  ОФ «Центр развития футзала»
                        </p>
                      </div>
                    </li>
                    <li class="info-rezume-content__item">
                      <div class="info-rezume-content__year">
                        2020 <br> по н.в.
                      </div>
                      <div class="info-rezume-content__info">
                        <h3>Консультант по местному законодательству и налогообложению</h3>
                        <p>
                          Филиал Закрытого Акционерного Общества "Моненко Иран" в КР. Энергетический проект Центральной и Южной Азии. CASA-1000 представляет собой строящийся в настоящее время проект стоимостью 1,16 млрд долларов США
                        </p>
                      </div>
                    </li>
                    <li class="info-rezume-content__item">
                      <div class="info-rezume-content__year">
                        2020 <br> по н.в.
                      </div>
                      <div class="info-rezume-content__info">
                        <h3>Руководитель проекта </h3>
                        <p>
                          Филиал ООО "Когон Сув Курилиш Узбекистан" в Кыргызстане. Реконструкция Ирригационной системы Кыргызской Республики. Проект «Магистральный канал Сарымсак», протяжностью 10 км в Таласской области.
                        </p>
                      </div>
                    </li>
                    <li class="info-rezume-content__item">
                      <div class="info-rezume-content__year">
                        2018 <br> по н.в.
                      </div>
                      <div class="info-rezume-content__info">
                        <h3>Директор филиала </h3>
                        <p>

                          Филиал АО "Genser Genel Muhendislik Taahhut ve Ticaret A.S." в Кыргызстане. Реабилитация сектора энергетики Кыргызстана. Проект Реконструкция Токтогульских ГЭС «Фаза 1» Lot-4. Проект: «Открытое Распределительное Устройство 500 кВ. и Пункт Перекидки 500 кВ.» КТГЭС
                          Филиал АО "Genser Genel Muhendislik Taahhut ve Ticaret A.S." в Кыргызстане Реабилитация сектора энергетики Кыргызстана проект реконструкция Токтогульских ГЭС «Фаза 1» Lot-4. Проект: «Открытое Распределительное Устройство 500 кВ. и Пункт Перекидки 500 кВ.» КТГЭС
                        </p>
                      </div>
                    </li>
                    <li class="info-rezume-content__item">
                      <div class="info-rezume-content__year">
                        2017 <br> 2020
                      </div>
                      <div class="info-rezume-content__info">
                        <h3>Бухгалтер</h3>
                        <p>
                          ОО “Центрально-азиатский Альянс против зависимости” в рамках международного проекта  “Фонд Сорос в Кыргызстане”: - “Доказательное документирование психических последствий насилия, пыток и жестокого обращения”
                        </p>
                      </div>
                    </li>
                    <li class="info-rezume-content__item">
                      <div class="info-rezume-content__year">
                        2016 <br> 2020
                      </div>
                      <div class="info-rezume-content__info">
                        <h3>Главный бухгалтер</h3>
                        <p>
                          Российское ОсОО “Munai ExIm” (Мунай Эксим)
                        </p>
                      </div>
                    </li>
<!--                    <li class="info-rezume-content__item">-->
                    <!--                      <div class="info-rezume-content__year">-->
                    <!--                        2012 <br> 2020-->
                    <!--                      </div>-->
                    <!--                      <div class="info-rezume-content__info">-->
                    <!--                        <h3>Главный бухгалтер ОсОО «Корпорация ЖАРАСУЛ»</h3>-->
                    <!--                      </div>-->
                    <!--                    </li>-->
                    <li class="info-rezume-content__item">
                      <div class="info-rezume-content__year">
                        2012 <br> 2017
                      </div>
                      <div class="info-rezume-content__info">
                        <h3>Главный бухгалтер</h3>
                        <p>
                          ОсОО Консалтинговая компания “ИШЕНИМ” (Ishenim Consulting Company)
                        </p>
                      </div>
                    </li>
<!--                    <li class="info-rezume-content__item">-->
<!--                      <div class="info-rezume-content__year">-->
<!--                        2013 <br> 2014-->
<!--                      </div>-->
<!--                      <div class="info-rezume-content__info">-->
<!--                        <h3>Бухгалтер</h3>-->
<!--                        <p>-->
<!--                          УОО «Ассоциация мини-футбола КР», г.Бишкек ОФ «Центр развития футзала»-->
<!--                        </p>-->
<!--                      </div>-->
<!--                    </li>-->
                    <li class="info-rezume-content__item">
                      <div class="info-rezume-content__year">
                        2013 <br> 2014
                      </div>
                      <div class="info-rezume-content__info">
                        <h3>Генеральный директор</h3>
                        <p>
                          ОсОО «Центрально Азиатская Консалтинговая Группа» (Ishenim Consulting Company) Филиалы: в Узбекистане г.Ташкент, в Таджикистане г.Душанбе
                        </p>
                      </div>
                    </li>
                    <li class="info-rezume-content__item">
                      <div class="info-rezume-content__year">
                        2012 <br> 2012
                      </div>
                      <div class="info-rezume-content__info">
                        <h3>Бухгалтер</h3>
                        <p>
                          Учреждение «Институт Нанотехнологий», г.Бишкек
                        </p>
                      </div>
                    </li>
                    <li class="info-rezume-content__item">
                      <div class="info-rezume-content__year info-rezume-content__year_last">
                        2006 <br> 2009
                      </div>
                      <div class="info-rezume-content__info">
                        <h3>Менеджер, помощник бухгалтера Совместное Кыргызско-Российское ОсОО «СТРОЙБАТ»</h3>
                      </div>
                    </li>
                  </ul>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import Footer from './subcomponents/footer.vue'

export default {
  name: 'Main',
  components:{
    Footer
  },
  data () {
    return {
      phone: require('../assets/image/section/phone.png'),
      envelop: require('../assets/image/section/envelop.png'),
      location: require('../assets/image/section/location.png'),
      onMap: require('../assets/image/section/onMap.png'),
      rezuemProf: require('../assets/image/rezumeProf.png'),
      profile: require('../assets/image/profile.png'),
      tw: '<svg width="33" height="26" viewBox="0 0 33 26" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M32.8235 3.06053C31.6154 3.57989 30.3192 3.93212 28.9572 4.08937C30.3479 3.28142 31.4124 1.99991 31.9169 0.477576C30.6124 1.22578 29.1725 1.76908 27.6383 2.0636C26.4097 0.792022 24.6622 0 22.7239 0C19.0053 0 15.9902 2.92524 15.9902 6.53105C15.9902 7.04245 16.0497 7.54193 16.1645 8.01956C10.5692 7.7469 5.60763 5.14604 2.28692 1.19394C1.70645 2.1571 1.37623 3.27939 1.37623 4.47739C1.37623 6.74398 2.56587 8.74388 4.37085 9.91394C3.26734 9.87814 2.22948 9.58362 1.32088 9.09408V9.17567C1.32088 12.3397 3.64272 14.9804 6.72138 15.5814C6.15732 15.7286 5.56252 15.8102 4.94719 15.8102C4.51238 15.8102 4.0919 15.7684 3.67962 15.6888C4.53695 18.2857 7.02291 20.1742 9.96829 20.2259C7.6649 21.9771 4.76055 23.0179 1.606 23.0179C1.06248 23.0179 0.527108 22.986 0 22.9283C2.98024 24.785 6.51838 25.8675 10.3211 25.8675C22.7076 25.8675 29.4783 15.9137 29.4783 7.28129L29.4557 6.43557C30.7786 5.52012 31.9231 4.36994 32.8235 3.06053Z" fill="white"/></svg>',
      fb:'<svg width="14" height="30" viewBox="0 0 14 30" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M2.943 5.65055C2.943 6.38581 2.943 9.66758 2.943 9.66758H0V14.5796H2.943V29.1765H8.98856V14.58H13.0454C13.0454 14.58 13.4253 12.2247 13.6095 9.64947C13.0815 9.64947 9.01142 9.64947 9.01142 9.64947C9.01142 9.64947 9.01142 6.7918 9.01142 6.29091C9.01142 5.78894 9.67057 5.11371 10.3221 5.11371C10.9723 5.11371 12.3447 5.11371 13.6159 5.11371C13.6159 4.44493 13.6159 2.13414 13.6159 0C11.9189 0 9.98837 0 9.13739 0C2.79356 -0.000339173 2.943 4.91658 2.943 5.65055Z" fill="white"/></svg>',
      insta: '<svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13.6728 9.11571C11.1615 9.11571 9.11211 11.1651 9.11211 13.6765C9.11211 16.1878 11.1615 18.2372 13.6728 18.2372C16.1841 18.2372 18.2335 16.1878 18.2335 13.6765C18.2335 11.1651 16.1841 9.11571 13.6728 9.11571ZM27.3514 13.6765C27.3514 11.7878 27.3685 9.91632 27.2625 8.03111C27.1564 5.8414 26.6569 3.89803 25.0557 2.2968C23.4511 0.692146 21.5111 0.196039 19.3215 0.0899748C17.4329 -0.0160895 15.5614 0.00101768 13.6762 0.00101768C11.7876 0.00101768 9.91614 -0.0160895 8.03096 0.0899748C5.84129 0.196039 3.89795 0.695568 2.29675 2.2968C0.692134 3.90145 0.196035 5.8414 0.0899731 8.03111C-0.0160892 9.91974 0.00101767 11.7913 0.00101767 13.6765C0.00101767 15.5617 -0.0160892 17.4366 0.0899731 19.3218C0.196035 21.5115 0.695555 23.4549 2.29675 25.0561C3.90137 26.6608 5.84129 27.1569 8.03096 27.263C9.91956 27.369 11.791 27.3519 13.6762 27.3519C15.5648 27.3519 17.4363 27.369 19.3215 27.263C21.5111 27.1569 23.4545 26.6574 25.0557 25.0561C26.6603 23.4515 27.1564 21.5115 27.2625 19.3218C27.3719 17.4366 27.3514 15.5651 27.3514 13.6765ZM13.6728 20.6938C9.78955 20.6938 6.65557 17.5598 6.65557 13.6765C6.65557 9.79315 9.78955 6.65912 13.6728 6.65912C17.556 6.65912 20.69 9.79315 20.69 13.6765C20.69 17.5598 17.556 20.6938 13.6728 20.6938ZM20.9774 8.01058C20.0708 8.01058 19.3386 7.2784 19.3386 6.37172C19.3386 5.46504 20.0708 4.73285 20.9774 4.73285C21.8841 4.73285 22.6162 5.46504 22.6162 6.37172C22.6165 6.58701 22.5743 6.80025 22.492 6.99921C22.4098 7.19816 22.2891 7.37894 22.1368 7.53117C21.9846 7.68341 21.8038 7.80412 21.6049 7.88638C21.4059 7.96865 21.1927 8.01085 20.9774 8.01058Z" fill="white"/></svg>',
      clsBtn: require('../assets/image/clsBtn.svg'),
      closesBtn: require('../assets/image/closeBtn.png'),
      isActiveSoc: false,
      isActiveCag: false,
      arrDown: require('../assets/image/arrow.svg'),
      isActiveAbout: false,
      isActiveRezume: false,
      isActiveGoal: false
    }
  },
  methods:{
    showGoal(){
      this.isActiveGoal = true
    },
    toGoals(){
      this.$router.push({ name: 'goals'})
    },
    showRezume(){
      this.isActiveRezume = true
    },
    showAboutMe(){
      this.isActiveAbout = true
    },
    showCages(){
      this.isActiveCag = true
    },
    showSocial(){
      this.isActiveSoc = true
    },
    clsModal(){
      this.isActiveSoc = false,
      this.isActiveCag = false,
      this.isActiveAbout = false,
      this.isActiveRezume = false,
      this.isActiveGoal = false
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style >

</style>
